import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:wa3iaa/Models/QuotesModel.dart';
import 'package:wa3iaa/UI/Components/ColumnPonitWidget.dart';
import 'package:wa3iaa/UI/Components/X2TableWidget.dart';
import 'package:wa3iaa/Utilities/ThemeOf.dart';

import '../../../../Constants.dart';
import 'Components/NawhIconWidget.dart';

class AlhnfManthurQanunScreen extends StatelessWidget {
  static const route = '/AlhnfManthurQanun';
  // final QuotesModel quote;
  // QuestionsScreen({required this.quote});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          backgroundColor: Constants.orangeColor,
          leading: IconButton(
            icon: Icon(
              Icons.arrow_back_ios,
              color: theme(context).backgroundColor,
            ),
            onPressed: () => Navigator.pop(context),
          ),
        ),
        body: Container(
          height: MediaQuery.of(context).size.height,
          width: MediaQuery.of(context).size.width,
          decoration: BoxDecoration(
            image: DecorationImage(
              image: AssetImage(Constants.bgFlower),
              fit: BoxFit.cover,
            ),
          ),
          child: SafeArea(
            child: SingleChildScrollView(
              child: Padding(
                padding:
                    const EdgeInsets.symmetric(horizontal: 25, vertical: 20),
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Padding(
                      padding: const EdgeInsets.symmetric(
                          horizontal: 15, vertical: 10),
                      child: Text(
                        "العنف القائم على النوع الاجتماعي من منظور القانون الدولي لحقوق الإنسان ",
                        style: theme(context).textTheme.headline5!.copyWith(
                            color: Constants.orangeColor,
                            fontSize: 30,
                            fontFamily: 'R016'),
                        textDirection: TextDirection.rtl,
                      ),
                    ),
                    SizedBox(
                      height: 10,
                    ),

                    /// Both Lists length should be same length...
                    X2TableWidget(
                      x1List: [
                        "نصّ على المساواة بين جميع البشر. وهو أول وثيقة دولية يعترف بالمرأة والرجل كشخصين متساويين.",
                        'القرار رقم 8 /  1991  الذي صدر تحت عنوان "العنف ضد المرأة بجميع أشكاله" وحثّ الدول على مكافحة العنف واتخاذ كافة التدابير المناسبة لحماية النساء من جميع أشكال العنف الجسدي والمعنوي.',
                        'عرّفت العنف على أنه "اعتداء جسدي أو معنوي مقصود من جهة تتمتع بسلطة مادية أو معنوية على جهة أخرى، وقد تكون هذه الجهة فرداً أو جماعة أو طبقة إجتماعية أو دولة تحاول إخضاع طرف آخر في إطار علاقة غير متكافئة اقتصادياً وإجتماعياً وسياسياً مما يتسبّب في إحداث أضرار مادية أو معنوية أو نفسية للفرد أو لجماعة أو لطبقة اجتماعية أو لدولة أخرى".',
                        'العنف القائم على أساس نوع الجنس هو شكل من أشكال التمييز يكبح قدرة المرأة على التمتع بحقوقها وحريتها على أساس المساواة مع الرجل.وورد في النقطة 6 التعليقات العامة تعريف المادة 1 من الاتفاقية التمييز ضد المرأة. ويشمل هذا التعريف العنف القائم على أساس نوع الجنس- أي العنف الموجه ضد المرأة بسبب كونها امرأة أو العنف الذي يمس المرأة على نحو جائر. ويشمل الأعمال التي تلحق ضررا أو ألما جسديا أو عقليا أو جنسيا بها، والتهديد بهذه الأعمال، والإكراه وسائر أشكال الحرمان من الحرية.إن العنف القائم على أساس نوع الجنس يخرق أحكاما محددة من الاتفاقية بصرف النظر عما إذا كانت تلك الأحكام ذكرت العنف صراحة أم لم تذكره.',
                        'العنف ضد المرأة "أي فعل عنيف تدفع إليه عصبية الجنس ويترتب عليه، أو يرجح أن يترتب عليه، أذى أو معاناة للمرأة ، سواء من الناحية الجسمانية أو الجنسية أو النفسية بما في ذلك التهديد بأفعال من هذا القبيل أو القسر أو الحرمان التعسفي من الحرية، سواء حدث ذلك في الحياة العامة أو الخاصة".',
                        "ربط المؤتمر العالمي بين العنف والتمييز ضد النساء، وأشار في الفقرة 38  ويشدد المؤتمر العالمي لحقوق الإنسان بصفة خاصة، على أهمية العمل من أجل القضاء على العنف ضد المرأة في الحياة العامة والخاصة، والقضاء على جميع أشكال المضايقة الجنسية، والاستغلال الجنسي والاتجار بالمرأة، والقضاء على التحيّز القائم على الجنس في إقامة العدل، وإزالة أي تضارب يمكن أن ينشأ بين حقوق المرأة والآثار الضارة لبعض الممارسات التقليدية أو المتصلة بالعادات والتعصب الثقافي والتطرف الديني.",
                        'مصطلح "العنف ضد المرأة " أي عمل من أعمال العنف القائم على نوع الجنس يترّتب عليه، أو من المحتمل أن يترّتب عليه، أذى بدني أو جنسي أو نفسي أو معاناة للمرأة، بما في ذلك التهديد بالقيام بأعمال من هذا القبيل، أو الإكراه أو الحرمان التعسفي من الحرية، سواء حدث ذلك في الحياة العامة أو الخاصة.',
                        'العنف القائم على أساس النوع  هو" العنف الذي يكون فيه الرجل والمرأة معنيان والذي ينتج عن عدم التوازن في علاقات السلطة بين المرأة والرجل ويكون العنف موجّهاً مباشرة ضد المرأة بأنها امرأة أو أنه يمّس المرأة بصفة متفاوتة ويتضمّن الممارسات النفسية، الجسمية، والجنسية، مثل التهديد، التعذيب، الاغتصاب، الحرمان من الحرية داخل الأسرة وخارجها إضافة إلى الممارسات التي تقودها الدولة أو الجماعات السياسية."',
                        'العنف القائم على أساس النوع هو بالأساس قائم على الاختلافات التي تم بناءها اجتماعياً وهو إنتهاك للحقوق، وينّص على أن"العنف القائم على أساس النوع الاجتماعي هو مصطلح يُطلق على أي فعل إيذاء والذي يُرتكب ضد إرادة شخص، ويستند على الاختلافات الاجتماعية بين الجنسين من الذكور والإناث، ويُعّد انتهاكاً لعدد من حقوق الإنسان العالمية والتي تحميها المواثيق الدولية والاتفاقيات.',
                        'لا يتعامل القرار مع النساء كضحايا حروب فقط بل يؤكد على أنه لا يمكن إحلال السلام دون أن يكون للنساء دوراً فاعلاً في صناعته، وبذلك يكون أول آلية تربط بين ديمومة السلام وإحقاق حقوق ومشاركة النساء، لذا فهو يعترف ويحدّد حقوق النساء انطلاقاً من الإدراك بأن النساء شخصيات فاعلة في المجتمع. ولذلك يجب ان يكون لهن دور أساسي في مراحل ما قبل وخلال وبعد النزاعات. ويعتبر هذا تغيير منهجي في التعامل مع قضايا النساء، ففي الوقت الذي ينص القرار على إيجاد آليات للحماية، يؤكد على الاعتراف بالنساء وبدورهن، كمواطنات فاعلات وكاملات الأهلية. ويحدّد القرار بأن خطط العمل لمناهضة العنف يجب أن تبنى على منظور النوع، لذا فإن القرار بذلك يحدد الإطار النظري والتحليلي للتعامل مع القضية، وبأنّ النوع يجب أن يكون الأداة التحليلية لكافة أشكال العنف ضد النساء. كل هذه المصطلحات تشير إلى انتهاكات حقيقية لحقوق الإنسان الأساسية، وانتهاكات ترسّخ الأدوار النمطية اعتماداً على النوع وتنتهك كرامة الإنسان وتلغي حق تقرير المصير، وتعرقل التنمية البشرية. كما يشير المصطلح بشكل عام إلى الأذى الجسدي والجنسي والنفسي الذي يعزّز مفهوم أن الإناث هنّ الجنس الأدنى ويشجّع استمرارية السلطة والسيطرة الذكورية الأبوية.',
                      ],
                      x2List: [
                        "الإعلان العالمي لحقوق الإنسان 1948",
                        'القرار رقم 8 /  1991 المجلس الاقتصادي والاجتماعي ',
                        "الجمعية العامة للأمم المتحدة ",
                        'لجنة القضاء على التمييز ضد المرأة "التوصية العامة 19 العنف ضد المرأة"',
                        "إعلان بشأن القضاء على العنف ضد المرأة ‎1993‏",
                        "المؤتمر العالمي لحقوق الإنسان، حزيران/يونيه 1993، إعلان وبرنامج عمل فيينا",
                        "إعلان ومنهاج عمل بيجين- مؤتمر العالمي المعني بالمرأة 1995",
                        "صندوق الأمم المتحدة للسكان 1998 ",
                        "منظمة الصحة العالمية - 2005",
                        'قرار مجلس الأمن في الأمم المتحدة  1325عام 2000 والخاص ب "المرأة والأمن والسلام" ',
                      ],
                    ),

                    Container(
                      width: MediaQuery.of(context).size.width,
                      margin: const EdgeInsets.symmetric(horizontal: 0, vertical: 30),
                      padding: const EdgeInsets.symmetric(horizontal: 15, vertical: 10),
                      decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(10),
                          color: theme(context).accentColor.withOpacity(0.25)),
                      child: Column(
                        children: [
                          Text(
                            "الملاحظات الختامية بشأن التقرير الدوري السابع للعراق",
                            textAlign: TextAlign.start,
                            style: theme(context)
                                .textTheme
                                .headline2!
                                .copyWith(color: Colors.black, fontSize: 20),
                          ),
                          SizedBox(height: 8,),
                          Text(
                            "تثني اللجنة على الدولة الطرف لاعتمادها عدداً من الاستراتيجيات والسياسات، ولا سيما الخطة الوطنية للتنمية (2018-2022) التي حدّدت المساواة بين الجنسين باعتبارها إحدى الأولويات الرئيسية لتنفيذ خطة التنمية المستدامة لعام 2030. بيد أن اللجنة تلاحظ بقلق إلغاء كل من وزارة الدولة لشؤون المرأة ووزارة حقوق الإنسان في 2015، مما يضعف تنفيذ الاستراتيجية الوطنية بشأن العنف ضد المرأة (2013-2017) الاستراتيجية الوطنية للنهوض بواقع المرأة العراقية (2014-2018). وتلاحظ اللجنة أيضا بقلق عدم وجود آلية تنسيق، وقد يؤدي هذا الأمر إلى ازدواجية في المهام وإلى فقدان أوجه التآزر ونقص في الكفاءة عند تنفيذ استراتيجيات وسياسات المساواة بين الجنسين. وتلاحظ اللجنة قيام الأمانة العامة لمجلس الوزراء في عام 2017 بإنشاء دائرة تمكين المرأة وإعادة تشكيل اللجنة العليا للنهوض بواقع المرأة العراقية واللجنة العليا للنهوض بواقع المرأة الريفية. غير أنها تشعر بالقلق لأن هاتين الهيئتين تفتقران إلى الموارد البشرية والتقنية والمالية اللازمة وإلى الوضوح في تحديد ولايتهما. وتشير اللجنة أيضا إلى أن المفوضية العليا لحقوق الإنسان في العراق، التي أُنشئت بموجب القانون رقم 53 لسنة 2008، لا تمتثل تماما للمبادئ المتعلقة بمركز المؤسسات الوطنية لتعزيز وحماية حقوق الإنسان (مبادئ باريس). الدورة الرابعة والسبعين (21 تشرين الأول/أكتوبر - 8 تشرين الثاني/نوفمبر 2019).",
                            textAlign: TextAlign.start,
                            style: theme(context)
                                .textTheme
                                .headline2!
                                .copyWith(color: Colors.black87, fontSize: 16),
                          ),
                        ],
                      ),
                    )
                  ],
                ),
              ),
            ),
          ),
        ),
    );
  }
}
